poneyinfo = {
'Snow_Tower':{'name':'白雪塔牡丹',
                  'othername':'白雪塔；玉楼春',
                  'conf':'0%',
                  'poneydata':'白雪塔原名玉楼春。宋代元丰年间出自河清县左氏家，左氏将此白牡丹献于潞公文彦博，潞公为其命名玉楼春。宋代周师厚在《洛阳牡丹记》中写道：“玉楼春千层白花也。类玉蒸饼而高，有楼子之状。”后来因此花盛开时莹白如雪，又层层堆积如玲珑之塔，人们广为称之为白雪塔。唐末诗人韦庄有《白牡丹》一诗，婉转地表达了他对白牡丹的喜爱之情：“闺中莫妒新妆妇，陌上须惭傅粉郎。昨夜月明浑似水，入门唯觉一庭香。”白雪塔之美，纯洁无瑕，晶莹剔透。其花朵皇冠形，外瓣大，内瓣细而皱，层叠高起呈球形，瓣基有紫晕。花径16厘米，花高8厘米，花初开绿白色，盛开时呈雪白。雄蕊绝大多数瓣化，雌蕊极不正常，柱头黄绿色，俗称青心。枝条细软，花盛开后，头稍下垂，与叶面齐平或稍藏于叶。白雪塔开花量大，花耐日晒，为中花品种。'},
    
'Bean_green':{'name':'豆绿',
                  'othername':'豆绿牡丹',
                  'conf':'0%',
                  'poneydata':"豆绿（学名：Paeonia suffruticosa 'Pea Green'）：牡丹四大名品之一。落叶灌木。茎高达2米；分枝短而粗。叶通常为二回三出复叶，顶生小叶宽卵形，表面绿色，无毛，背面淡绿色，有时具白粉，沿叶脉疏生短柔毛或近无毛。花单生枝顶，苞片5，长椭圆形，大小不等；萼片5，绿色，宽卵形，大小不等；花为重瓣，皇冠型或绣球型。花蕾圆形，顶端常开裂；花黄绿色，顶端呈不规则的波状；花丝上部白色，花药长圆形，花盘革质，杯状，紫红色；心皮5，密生柔毛。蓇葖长圆形，密生黄褐色硬毛。花期5月；果期6月。"},
    
'Two_Joe':   {'name':'二乔',
                  'othername':'洛阳锦，花二乔',
                  'conf':'0%',
                  'poneydata':"二乔（学名：Paeonia suffruticosa 'Two Qiao'）：别名洛阳锦，牡丹名品种之一。落叶灌木。株型高，茎高达2米，直立。枝较细硬，一年生枝长，节问亦长；鳞芽圆尖形。中型圆叶，叶通常为二回三出复叶，表面绿色，无毛，背面淡绿色，有时具白粉，沿叶脉疏生短柔毛或近无毛。花单生枝顶，苞片5，长椭圆形，大小不等；萼片5，绿色，宽卵形，大小不等。花朵蔷薇型，花蕾扁圆形，花复色，同株、同枝町开紫红色和粉色两色花；同朵亦可开相嵌紫粉两色。花丝上部白色，花药长圆形，花盘革质，杯状，紫红色；心皮5，密生柔毛。蓇葖长圆形，密生黄褐色硬毛。"},
 
 'Drunk_Yang_Fei':{'name':'酒醉杨妃',
                  'othername':'无',
                  'conf':'0%',
                  'poneydata':'酒醉杨妃：落叶灌木，新枝绿色有紫晕，分枝短而粗。芽为圆尖形，土芽稀少。叶通常为二回三出复叶，顶生小叶宽卵形，表面绿色，无毛，背面淡绿色，有时具白粉，沿叶脉疏生短柔毛或近无毛。花单生枝顶，苞片5，长椭圆形，大小不等；萼片5，绿色，宽卵形，大小不等；花朵为荷花型或托桂型，偶呈皇冠型。花粉紫色。花丝上部白色，花药长圆形，花盘革质，杯状，紫红色；心皮5，密生柔毛。蓇葖长圆形，密生黄褐色硬毛。花期5月；果期6月。酒醉杨妃是牡丹名贵品种，开粉紫色花，盛开顶部为粉红色。由于植株枝条柔软，花头下垂，纤纤醉态，故名“酒醉杨妃”。'},
 
 'Luoyang_Red':{'name':'洛阳红',
                  'othername':'紫二乔、焦骨牡丹',
                  'conf':'0%',
                  'poneydata':"洛阳红（学名：Paeonia suffruticosa cv. 'Luoyang Red'）：牡丹品种，落叶灌木。株型高，直立。分枝较细而硬。叶宽卵形，表面绿色，无毛，背面淡绿色，有时具白粉，沿叶脉疏生短柔毛或近无毛。花单生枝顶，苞片5，长椭圆形，大小不等；萼片5，绿色，宽卵形，大小不等；花朵蔷薇型。花蕾圆尖形。花紫红色，有光泽。花丝上部白色，花药长圆形，花盘革质，杯状，紫红色；心皮5，密生柔毛。蓇葖长圆形，密生黄褐色硬毛。花期5月；果期6月。源自唐代的洛阳红，是唯一以洛阳命名的牡丹品种。栽培供观赏。"},

 'Qinglong_lying_in_ink_pool':{'name':'青龙卧墨池',
                  'othername':'黑牡丹',
                  'conf':'0%',
                  'poneydata':"青龙卧墨池（学名：Paeonia suffruticosa 'Greendragon Sleeping Pool'）：是牡丹名品。落叶灌木，株丛开展，枝繁叶茂。叶肥大而圆，质厚，小叶卵形，缺刻少而钝。叶面绿色带紫晕。花浅墨紫色，托桂型，有时为皇冠型。基部色泽明显加深、宽大、圆整的二轮外瓣围绕着细碎而卷曲的内瓣，正中的雌蕊瓣化成青绿色，狭长、翻卷的彩瓣，周围是墨紫色的多层花瓣，似一条青龙盘卧于墨池中央，故称之青龙卧墨池。观赏价值高，生长旺盛，着花多，是著名的老品种之一。"},

 'Wei_Zi':{'name':'魏紫',
                  'othername':'洛阳魏紫',
                  'conf':'0%',
                  'poneydata':"魏紫（学名：Paeonia suffruticosa 'Wei Purple'）：落叶灌木，株型中高，半开展。枝较粗壮，一年生枝较短，节间较短。出自五代时期洛阳魏仁博家，具有极致的重瓣之美。是名贵的牡丹花品种，花紫红色，荷花形或皇冠形。花期长，花量大，花朵丰满，被推为“花后”。给人以温馨热烈的美感，增添成功、喜庆、富贵、吉祥的感觉，观赏性极强。"},

 'Yao_Huang':{'name':'姚黄',
                  'othername':'无',
                  'conf':'0%',
                  'poneydata':"姚黄（学名：Paeonia suffruticosa 'Yaohuang'）：是牡丹四大名品之一。落叶灌木，株形直立，枝条细硬，分枝短而粗。叶通常为二回三出复叶，顶生小叶宽卵形，表面绿色，无毛，背面淡绿色，有时具白粉，沿叶脉疏生短柔毛或近无毛。花单生枝顶，苞片5，长椭圆形，大小不等；萼片5，绿色，宽卵形，大小不等；花朵皇冠型，有时呈金环型。花蕾圆尖形，端部常开裂；花淡黄色；花丝上部白色，花药长圆形，花盘革质，杯状，紫红色；心皮5，密生柔毛。蓇葖长圆形，密生黄褐色硬毛。花期5月；果期6月。中花品种，长势较强，成花率高，开花整齐，花形丰满，古人以“花王”誉之。"},
 
 'Royal_Yellow':{'name':'御衣黄',
                  'othername':'老黄（俗名）',
                  'conf':'0%',
                  'poneydata':'因其色如君王袍服之色，故称。 清 钮琇 《觚賸·牡丹述》：“御衣黄，俗名老黄，晓视甚白，午候转为浅黄，莺然可爱。”亦省称“ 御黄 ”。 宋 秦观 《春词绝句》之三：“浅色御黄应好在，为谁还发去年枝。”“御衣黄”是传统的黄色系牡丹中开品种，其花朵呈荷花或菊花形状。在清朝，“御衣黄”为花中极品，富贵人家以千两白银而难求一株。黄牡丹本来就十分稀缺，除了有“花王”之称的姚黄外，“御衣黄”可称得上此系列中的上品。其花盛开后直径一般在15厘米左右，花瓣宽大，呈波浪状；花色淡黄，花蕊呈金黄色。'},

 'Zhao_Fan':{'name':'赵粉',
                'othername':'无',
                'conf':'0%',
                'poneydata':"赵粉（学名：Paeonia suffruticosa 'Zhao Pink'）：落叶灌木。株型中高，开展。分枝短而粗，枝较软而弯曲，一年生枝长，浅绿色。叶通常为二回三出复叶，顶生小叶宽卵形，表面绿色，无毛，背面淡绿色，有时具白粉，沿叶脉疏生短柔毛或近无毛。花单生枝顶，苞片5，长椭圆形，大小不等；萼片5，绿色，宽卵形，大小不等；花瓣为重瓣，花朵皇冠型，有时呈荷花型、金环型或托桂型。花蕾大，圆尖形；花粉色。花丝上部白色，花药长圆形，花盘革质，杯状，紫红色；心皮5，密生柔毛。蓇葖长圆形，密生黄褐色硬毛。花期5月；果期6月。在牡丹四大名种中最年轻。据《桑篱园牡丹谱》中记载：“赵粉是将冰凌罩红石（一名童子面）从洛阳移至曹州赵氏园培育而成。芳香浓郁、善于着花，具有单瓣半重瓣，重瓣3种花型，有的3种花型同生一树。”由于它的优点特别显著，所以不胫而走，声誉大震。与姚黄，魏紫，豆绿并称牡丹四大名品。园艺品种，栽培供观赏。"},
}